import ru.valiullin.ToLeft;

public class Main {

    /**
     * TODO:
     * Дан двумерный массив. Задача – написать метод
     * public void toLeft() {}
     * 1.Пройти с 1-ой до последней строки
     * 2.Пройти с 1-го до предпоследнего элемента
     * 3.В текущую ячейку поместить значение следующей
     * 4.Последнему элементу присвоить 0
     *
     */

    /**
     * Revers
     * TODO:
     * Задача: Имеется массив, нужно переставить элементы массива в обратном порядке.
     * Вывести массив в консоль до и после вызова метода по реверсу массива
     *111
     */

    public static void main(String[] args) {
        ToLeft.toLeft();
        System.out.println(" =====revers===== ");
        ToLeft.revers();
    }


}
